{
  "experience": [
    {
      "role": "starszy programista frontend",
      "company": "Akademia Górniczo-Hutnicza im. Stanisława Staszica w Krakowie",
      "description": "Naszym zadaniem (jako zespół frontendowy) było zaprojektowanie oraz wydanie wersji MVP dwóch projektów przeznaczonych na cele uczelni. Pracowaliśmy w SCRUM'ie, a sam zespół złożony był z wielu osób - backendowców, testerów, menadżerów itd.",
      "achievements": "Termin realizacji projektów był bardzo krótki, ale byliśmy w stanie zaprojektować na tyle elastyczną i skalowalną architekturę, że udało nam się zrealizować postawione przed nami zadanie.",
      "techStack": ["Next.js", "Typescript", "TailwindCSS"],
      "startTime": "03.2023",
      "endTime": "12.2023"
    },
    {
      "role": "starszy programista frontend",
      "company": "1000i",
      "description": "Projekt przy którym pracowałem sam, a który polegał na przepisaniu poprzedniej wersji aplikacji na nową w celu poprawienia jej SEO oraz wydajności. Pierwsza wersja była napisana z wykorzystaniem Reacta, jednak postanowiłem wykorzystać Next.js, aby zapewnić Server Side Rendering oraz Static Site Generation.",
      "achievements": "Największym sukcesem tego projektu był wynik testu Lighthouse wersji produkcyjnej, który wyniósł kolejno 98 oraz 100 punktów przy wartościach 'performance' oraz 'SEO'. Dodatkowo udało mi się zrealizować projekt w niewiele ponad miesiąc.",
      "techStack": ["Next.js", "Typescript", "strapi", "Sass"],
      "startTime": "02.2023",
      "endTime": "12.2023"
    },
    {
      "role": "programista frontend",
      "company": "Scalo",
      "description": "W ramach pracy dla Scalo byłem 'outsourcowany' do zewnętrznego klienta z branży finansowej, do działu cyberbezpieczeństwa. W tym projekcie byłem jedynym frontend developerem, a moim zadaniem było zaprojektowanie oraz development wewnętrznej aplkacji z użyciem Angulara w wersji 9+. Zespół uzupełniało 3 backendowców oraz menadżer projektu, a całość realizowana była w SCRUM'ie. Oprócz warstwy czysto frontendowej, odpowiedzialny byłem również za część UX/UI.",
      "achievements": "Nad projektem pracowałem 3 lata i przez ten czas urósł on do rozmiarów bardzo dużej aplikacji, zbudowanej z kilkudziesięciu modułów, która przy złej architekturze mogłaby być bardzo trudna w utrzymaniu. To, że udało mi się zaprojektować ją w taki sposób, aby tego uniknąć, jest moim największym osiągnięciem.",
      "techStack": ["Angular 9+", "Sass"],
      "startTime": "04.2020",
      "endTime": "09.2023"
    },
    {
      "role": "programista frontend",
      "company": "MediaAmbassador",
      "description": "Praca, która polegała na realizowaniu wielu projektów z branży e-commerce. Większość z nich była tworzona z użyciem Angulara, jednak te starsze, które należało utrzymywać, bazowały na narzędziach takich jak JQuery czy AngularJS. Pracowaliśmy nad kilkoma projektami na raz, w małych zespołach, w których panowała duża rotacja projektów.",
      "achievements": "Najważniejszym osiągnięciem było wypracowanie wraz zespołem modelu pracy, który umożliwił nam seryjną realizację projektów w krótkim czasie, przy jednoczesnym zachowaniu wysokiej jakości kodu. Byliśmy zdolni do oddawania jednego sklepu internetowego co ok. 1-2 miesiące.",
      "techStack": ["Angular 2+", "Sass"],
      "startTime": "03.2018",
      "endTime": "04.2020"
    },
    {
      "role": "młodszy programista frontend",
      "company": "Appevo",
      "description": "Była to swoista kontynuacja pracy w Lithium. Miałem okazję ugruntować swoją wiedzę i umiejętności, których nauczyłem się w poprzednim miejscu pracy.",
      "achievements": "Udało mi się stworzyć swego rodzaju 'setup bazowy', dzięki któremu łatwiej było mi zaczynać każdy kolejny projekt i który bardzo ułatwiał mi początkowe prace.",
      "techStack": ["HTML", "CSS/Sass", "JQuery", "WordPress"],
      "startTime": "01.2017",
      "endTime": "08.2017"
    },
    {
      "role": "młodszy programista frontend",
      "company": "Lithium",
      "description": "Moim zadaniem było programowanie prostych stron internetowych (w ścisłej współpracy z designerem) wraz z późniejszym wdrożeniem ich na Wordpressa. Nie licząc wsparcia merytorycznego senior developera, nad częścią developerską pracowałem samodzielnie.",
      "achievements": "Jako, że nie miałem wielkiego doświadczenia we frontendzie, to samo realizowanie projektów bez opóźnień było dla mnie dużym osiągnięciem.",
      "techStack": ["HTML", "CSS/Sass", "JQuery", "WordPress"],
      "startTime": "09.2016",
      "endTime": "01.2017"
    }
  ],
  "education": [
    {
      "school": "Politechnika Wrocławska",
      "degree": "Inżynier",
      "fieldOfStudy": "Elektronika",
      "startTime": "2016",
      "endTime": "2022",
      "specialization": "zastosowania inżynierii komputerowej w technice"
    },
    {
      "school": "Publiczne technikum nr 5 w Opolu",
      "fieldOfStudy": "Technik informatyk",
      "startTime": "2011",
      "endTime": "2015"
    }
  ],
  "portfolio": [
    {
      "name": "Sevi Kebab",
      "img": "/sevikebab.png",
      "description": "Opisik",
      "href": "https://sevikebab.pl/",
      "company": "Lithium"
    },
    {
      "name": "Bytom",
      "img": "/bytom.png",
      "description": "Opisik",
      "href": "https://bytom.com.pl/",
      "company": "MediaAmbassador"
    },
    {
      "name": "Grzebieluch stomatologia",
      "img": "/grzebieluch.png",
      "description": "Opisik",
      "href": "http://www.grzebieluch.pl/",
      "company": "Lithium"
    },
    {
      "name": "Qubus Hotel",
      "img": "/qubus.png",
      "description": "Opisik",
      "href": "https://www.qubushotel.com/pl/",
      "company": "MediaAmbassador"
    },
    {
      "name": "BigStar",
      "img": "/bigstar.png",
      "description": "Opisik",
      "href": "https://bigstar.pl/",
      "company": "MediaAmbassador"
    },
    {
      "name": "Callpage",
      "img": "/callpage.png",
      "description": "Opisik",
      "href": "https://www.callpage.io/pl/",
      "company": "1000i"
    },
    {
      "name": "Willa pod błękitnym koniem",
      "img": "/willa.png",
      "description": "Opisik",
      "href": "http://podblekitnymkoniem.pl/",
      "company": "Lithium"
    },
    {
      "name": "Notariuszka Wrocław",
      "img": "/notariuszka.png",
      "description": "Opisik",
      "href": "https://notariuszkawroclaw.pl/",
      "company": "Lithium"
    }
  ]
}
